#+STARTUP: content
#+STARTUP: nohideblocks

* takeokunn's braindump

[[https://takeokunn.org][https://takeokunn.org]]

This is a [[https://en.wikipedia.org/wiki/Zettelkasten][Zettelkasten]] blog generated by [[https://www.orgroam.com/][org-roam]] and [[https://ox-hugo.scripter.co/][ox-hugo]].

Using [[https://github.com/takeokunn/hugo-take-theme][takeokunn/hugo-take-theme]].

** Build locally

generate org to markdown:

#+begin_src shell
  $ emacs --batch -l script.el -f export-org-files
#+end_src

run Hugo server:

#+begin_src shell
  $ hugo server
#+end_src

** Update theme

#+begin_src shell
   git submodule update --remote --recursive
#+end_src

#+RESULTS:
: Submodule path 'themes/hugo-take-theme': checked out 'ed4de5e4424625146eef54c555b4a257fff90a7e'
